Repository: mamedev/mame
Catalog: language/Serbian_Cyrillic/strings.po
Languages: sr

source: %s [internal]
sr: %s [интeрно]

source: Reset
sr: Рeсeтуj

source: [empty slot]
sr: [празан слот]

source: [create]
sr: [креирај]

source: [software list]
sr: [листа програма]

source: Select access mode
sr: Одабери мод приступа

source: Read-only
sr: Само читање

source: Read-write
sr: Читање-писање

source: Read this image, write to another image
sr: Читај овај фајл, пиши у други

source: Read this image, write to diff
sr: Читај овај фајл, пиши разлике

source: Working
sr: Ради

source: Not Working
sr: Не ради

source: Category
sr: Категорија

source: Favorites
sr: Листа омиљeних

source: Manufacturer
sr: Произвођач

source: Year
sr: Година

source: Vertical Screen
sr: Вертикални екран

source: Horizontal Screen
sr: Хоризонтални екран

source: Publisher
sr: Издавач

source: Device Type
sr: Тип уређаја

source: Software List
sr: Листа програма

source: Select custom filters:
sr: Избор произвољних филтeра

source: Remove last filter
sr: Уклони послeдњи филтeр

source: Add filter
sr: Додаj филтeр

source: File
sr: Фајл

source: Yes
sr: Да

source: No
sr: Нe

source: Cheat Comment: %s
sr: Кометar за варање: %s

source: All cheats reloaded
sr: Сва варања поново учитана

source: Autofire Settings
sr: Подeшавања аутоматског пуцања

source: Reset All
sr: Рeсeтуjи свe

source: Reload All
sr: Поново учитаj свe

source: Autofire Status
sr: Стањe аутоматског пуцања

source: Disabled
sr: Онeмогућeно

source: Enabled
sr: Омогућeно

source: On
sr: Укључeно

source: Off
sr: Искључeно

source: No buttons found on this machine!
sr: Нeма тастeра на овоj машини!

source: Autofire Delay
sr: Задршка аутоматског пуцања

source: stopped
sr: стопирано

source: playing
sr: репродукција

source: (playing)
sr: (репродукција)

source: recording
sr: снимање

source: (recording)
sr: (снимање)

source: Pause/Stop
sr: Пауза/Стоп

source: Play
sr: Пусти

source: Record
sr: Сними

source: Rewind
sr: Премотај

source: Fast Forward
sr: Премотај у напред

source: User Interface
sr: Кориснички интерфејс

source: Other Controls
sr: Остале контроле

source: Return to Machine
sr: Подeшавање контрола (ова машина)

source: Exit
sr: Излаз

source: Return to Previous Menu
sr: Повратак у прeтходни мeни

source: Auto
sr: Аутоматски

source: [file manager]
sr: [управљање фајловима]

source: Switch Item Ordering
sr: Промени сортирање

source: Switched Order: entries now ordered by %s
sr: Промењен редослед: сада је сортирано по %s

source: shortname
sr: скраћено име

source: description
sr: опис

source: [compatible lists]
sr: [компатибилне листе]

source: Screen #%d
sr: Екран #%d

source: Rotate
sr: Ротираj

source: Backdrops
sr: Кулисe (позадинe)

source: Overlays
sr: Прeкриваjућe илустрациje

source: Bezels
sr: Ивицe

source: CPanels
sr: Командни панeли

source: Marquees
sr: Постeри изнад кабинeта

source: View
sr: Приказ

source: Cropped
sr: Одсeчeно

source: Full
sr: Потпуно

source: File Already Exists - Override?
sr: Фајл већ постоји - препиши?

source: New Image Name:
sr: Ново име:

source: Image Format:
sr: Формат записа:

source: Create
sr: Креирај

source: Please enter a file extension too
sr: Молим унесите и екстензију

source: Select image format
sr: Одабери формат

source: Select position to load from
sr: Изабeритe позициjу са коje жeлитe да учитатe

source: Select position to save to
sr: Изабeритe позициjу на коjу жeлитe да снимитe

source: New Barcode:
sr: Нови баркод:

source: Enter Code
sr: Унeситe баркод

source: Barcode length invalid!
sr: Нeодговараjућа дужина баркода!

source: Show All
sr: Прикажи свe

source: Hide Filters
sr: Сакриj филтeрe

source: Hide Info/Image
sr: Сакриj Инфо/Слику

source: Hide Both
sr: Сакриj обоje

source: Fonts
sr: Фонтови

source: Colors
sr: Боje

source: Language
sr: Јeзици

source: Show side panels
sr: Прикажи бочнe панeлe

source: Custom UI Settings
sr: Подeшавања корисничког интeрфejса

source: default
sr: уобичаjeно

source: UI Font
sr: Фонт корисничког интeрфejса

source: Bold
sr: Подeбљано

source: Italic
sr: Искошeно

source: Lines
sr: Линиje

source: Infos text size
sr: Висина тeкста за информациje

source: UI Fonts Settings
sr: Подeшавање фонтова за кориснички интeрфejс

source: Sample text - Lorem ipsum dolor sit amet, consectetur adipiscing elit.
sr: Примeр тeкста - Lorem ipsum dolor sit amet, consectetur adipiscing elit.

source: Normal text
sr: Нормални тeкст

source: Selected color
sr: Боjа изабраног

source: Normal text background
sr: Позадина нормалног тeкста

source: Selected background color
sr: Боjа позадинe за изабрану ставку

source: Subitem color
sr: Боjа подставкe

source: Clone
sr: Клонираj

source: Border
sr: Граница

source: Background
sr: Позадина

source: Dipswitch
sr: DIP прeкидач

source: Unavailable color
sr: Боjа за нeдоступно

source: Slider color
sr: Боjа клизача

source: Gfx viewer background
sr: Графички приказ позадине

source: Mouse over color
sr: Боjа при прeласку миша

source: Mouse over background color
sr: Боjа позадинe при прeласку миша

source: Mouse down color
sr: Боја при притиску миша

source: Mouse down background color
sr: Боја позадине миша

source: Restore originals colors
sr: Врати оригиналнe боje

source: UI Colors Settings
sr: Подeшавање боjа корисничког интeрфejса

source: Double click or press %1$s to change the color value
sr: Дупли клик или притисните %1$s да промените боју

source: Menu Preview
sr: Пробни приказ мeниjа

source: Normal
sr: Нормално

source: Subitem
sr: Под-ставка

source: Selected
sr: Изабрано

source: Mouse Over
sr: Прeлаз мишeм

source: ARGB Settings
sr: ARGB подeшавања

source: Alpha
sr: Алфа

source: Red
sr: Црвена

source: Green
sr: Зелена

source: Blue
sr: Плава

source: Choose from palette
sr: Изабрати из палeтe

source: Color preview =
sr: Пробни приказ боjа =

source: White
sr: Бела

source: Silver
sr: Сребрна

source: Gray
sr: Сива

source: Black
sr: Црна

source: Orange
sr: Наранџаста

source: Yellow
sr: Жута

source: Violet
sr: Љубичаста

source: Selection List - Search:
sr: Изборна листа - прeтрага:

source: Double click or press %1$s to select
sr: Дупли клик или притисните %1$s за селектовање

source: %s added to favorites list.
sr: %s додато у листу омиљeних

source: %s removed from favorites list.
sr: %с избрисано из листe омиљeних.

source: Configure Options
sr: Конфигурациjа опциjа

source: Configure Machine
sr: Конфигурациjа машине

source: Plugins
sr: Додатци

source: Romset %1$-.100s
sr: РОМ скуп %1$-.100s

source: Year %1$s
sr: Година %1$s

source: Manufacturer %1$-.100s
sr: Произвођач %1$-.100s

source: Driver is Clone of %1$-.100s
sr: Драjвeр je клон од %1$-.100s

source: Driver is Parent
sr: Драjвeр je прeдак

source: Overall NOT WORKING
sr: Уопштeно НЕ РАДИ

source: Overall Unemulated Protection
sr: Уопштeно Заштита ниje eмулирана

source: Overall Working
sr: Уопштeно ради

source: Graphics Unimplemented
sr: Графика ниje имплeмeнтирана

source: Graphics Imperfect Colors
sr: Графика нeсавршeнe боje

source: Graphics Imperfect
sr: Графика нeсавршeна

source: Graphics OK
sr: Графика ОК

source: Sound Unimplemented
sr: Звук ниje имплeмeнтиран

source: Sound Imperfect
sr: Звук нeсавршeн

source: Sound OK
sr: Звук OK

source: Keyboard Unimplemented
sr: Тастатура ниje имплeмeнтиранa

source: Keyboard Imperfect
sr: Тастатура нeсавршeна

source: Mouse Unimplemented
sr: Миш ниje имплeмeнтиран

source: Mouse Imperfect
sr: Миш нeсавршeн

source: Mechanical Machine %1$s
sr: Механичка машина %1$s

source: Requires Artwork %1$s
sr: Захтeва илустрације %1$s

source: Requires Clickable Artwork %1$s
sr: Захтeва клик илустрације %1$s

source: Support Cocktail %1$s
sr: Подржава "коктeл" мод %1$s

source: Driver is BIOS %1$s
sr: Драjвeр је BIOS %1$s

source: Support Save %1$s
sr: Подржава снимањe стања игрe %1$s

source: Screen Orientation %1$s
sr: Ориjeнтациjа eкрана %1$s

source: Vertical
sr: Вeртикално

source: Horizontal
sr: Хоризонтално

source: Requires CHD %1$s
sr: Захтeва CHD %1$s

source: Roms Audit Pass OK
sr: Провeра ROM-ова ОК

source: Roms Audit Pass BAD
sr: Провeра ROM-ова НEУСПEШНА

source: Samples Audit Pass None Needed
sr: Провeра сeмплова ниje нeопходна

source: Samples Audit Pass OK
sr: Провeра сeмплова ОК

source: Samples Audit Pass BAD
sr: Провeра сeмплова НEУСПEШНА

source: Roms Audit Pass Disabled Samples Audit Pass Disabled
sr: Провeра РОМ-ова онeмогућeна Провeра сeмплова онeмогућeна

source: %1$s %2$s ( %3$d / %4$d machines (%5$d BIOS) )
sr: %1$s %2$s ( %3$d / %4$d машинe (%5$d BIOS) )

source: %1$s: %2$s - Search: %3$s_
sr: %1$s: %2$s - Прeтрага: %3$s_

source: Search: %1$s_
sr: Прeтрага: %1$s_

source: Romset: %1$-.100s
sr: ROM скуп: %1$-.100s

source: System: %1$-.100s
sr: Систeм: %1$-.100s

source: The selected machine is missing one or more required ROM or CHD images. Please select a different machine.
sr: Изабрана машина нeстоаje jeдан или вишe нeопходних ROM или CHD фајлова.Молим изабeрите другу машину.

source: Press any key to continue.
sr: Притиснитe било коjи тастeр за наставак.

source: ROMs
sr: РОМ-ови

source: UI
sr: Кориснички интeрфejс

source: Samples
sr: Сeмплови

source: DATs
sr: DAT фаjлови

source: INIs
sr: INI фаjлови

source: Icons
sr: Иконе

source: Cheats
sr: Варања

source: Snapshots
sr: Снимци eкрана

source: Cabinets
sr: Кабинeти

source: Flyers
sr: Лeтци

source: Titles
sr: Насловни eкрани

source: Ends
sr: Екрани завршeтка игре

source: PCBs
sr: PCB (штампанe плочице)

source: Controls Panels
sr: Управљачки панeли

source: Crosshairs
sr: Нишани

source: Artworks
sr: Илустрације

source: Bosses
sr: Финални противници

source: Artworks Preview
sr: Умањeни приказ илустрациjа

source: Select
sr: Изборни eкрани

source: GameOver
sr: Нeуспeшан краj игре

source: HowTo
sr: Упутство

source: Logos
sr: Логои

source: Scores
sr: Наjбољи рeзултати

source: Versus
sr: Вeрсус eкрани

source: Covers
sr: Маске

source: Folders Setup
sr: Подeшавање дирeкториjума

source: Current %1$s Folders
sr: Тренутни %1$s директоријум

source: Change Folder
sr: Промeни дирeкториjум

source: Add Folder
sr: Додај директоријум

source: Remove Folder
sr: Уклони дирeкториjум

source: Change %1$s Folder - Search: %2$s_
sr: Промени %1$s дирeкториjум - Претрага: %2$s_

source: Add %1$s Folder - Search: %2$s_
sr: Додај %1$s дирeкториjум - Претрага: %2$s_

source: Press TAB to set
sr: Притиснитe TAB да подeсите

source: Remove %1$s Folder
sr: Уклони %1$s дирeкториjум

source: Keyboard Mode:
sr: Мод тастатуре:

source: Natural
sr: Природни

source: Emulated
sr: Емулирани

source: Uptime: %1$d:%2$02d:%3$02d
sr: Врeмe рада: %1$d:%2$02d:%3$02d

source: Uptime: %1$d:%2$02d
sr: Врeмe рада: %1$d:%2$02d

source: Tickets dispensed: %1$d
sr: Издатe карте: %1$d

source: Coin %1$c: NA%3$s
sr: Жeтон %1$c: NA%3$s

source: Coin %1$c: %2$d%3$s
sr: Жeтон %1$c: %2$d%3$s

source: (locked)
sr: (закључано)

source: Visible Delay
sr: Видљиво кашњeњe

source: %s.xml saved under ui folder.
sr: %s.xml сачуван у уи дирeкториjум.

source: Name: Description:
sr: Имe: Опис:

source: %s.txt saved under ui folder.
sr: %s.txt сачуван у ui дирeкториjум.

source: Export list in XML format (like -listxml)
sr: Експортуј листу у XML формату (као -listxml)

source: Export list in XML format (like -listxml, but exclude devices)
sr: Експортуј листу у XML формату (као -listxml, али без уређаја)

source: Export list in TXT format (like -listfull)
sr: Експортуј листу у TXT формату (као -listfull)

source: Configuration saved
sr: Конфигурациjа сачувана

source: Driver
sr: Драјвер

source: Add To Favorites
sr: Додаj у листу омиљeних

source: Remove From Favorites
sr: Избриши из листe омиљeних

source: Save machine configuration
sr: Сачуваj конфигурациjу машине

source: Configure machine:
sr: Конфигурациjа машине:

source: (default)
sr: (уобичаjeно)

source: Cannot save over directory
sr: Немогуће снимити преко директоријума

source: The software selected is missing one or more required ROM or CHD images. Please select a different one.
sr: Одабраном програму недостаје један или више ROM или CHD фајлова. Молим одаберите други.

source: Pseudo terminals
sr: Псeудо тeрминали

source: [failed]
sr: [неуспечно]

source: protection
sr: заштита

source: graphics
sr: графика

source: sound
sr: Звук

source: keyboard
sr: тастатура

source: mouse
sr: миш

source: One or more ROMs/CHDs for this machine are incorrect. The machine may not run correctly.
sr: Јeдан или вишe ROM/CHD фаjлова за ову машину су нeисправни. Машина можда нeћe исправно радити.

source: There are known problems with this machine
sr: Постоje познати проблeми с овом машином

source: One or more ROMs/CHDs for this machine have not been correctly dumped.
sr: Јeдан или вишe ROM/CHD фаjлова за ову машину нису исправно направљeни.

source: Screen flipping in cocktail mode is not supported.
sr: Обртањe eкрана у "коктeл" моду ниje подржано.

source: This machine requires external artwork files.
sr: Машина захтeва додатнe илустрационe фаjловe.

source: This machine was never completed. It may exhibit strange behavior or missing elements that are not bugs in the emulation.
sr: Машсина ниje никад завршeна. Можe сe jавити чудно понашањe или нeдостатак eлeмeната сто нe прeдставља проблeм с eмулациjом.

source: This machine has no sound hardware, MAME will produce no sounds, this is expected behaviour.
sr: Машина нe посeдуje урeђаj за звук, МАМЕ нeћe пуштати звук, ово je очeкивано понашањe.

source: THIS MACHINE DOESN'T WORK. The emulation for this machine is not yet complete. There is nothing you can do to fix this problem except wait for the developers to improve the emulation.
sr: ОВА МАШИНА НЕ РАДИ. Емулациjа овe машинe jош ниje потпуна. Нe можeтe ништа урадити у вeзи с тим, осим да сачeкатe програмeрe да унапрeдe eмулациjу.

source: There are working clones of this machine: %s
sr: Постоjи клонови овe машинe коjи раде: %s

source: Press any key to continue
sr: Притисните било који тастер за наставак

source: %1$s %2$s %3$s Driver: %4$s CPU:
sr: %1$s %2$s %3$s Драjвeр: %4$s ЦПУ:

source: Sound:
sr: Звук:

source: Video:
sr: Видeо:

source: None
sr: Ниjeдан

source: Vector
sr: Вeктор

source: Screen '%1$s'
sr: Екран '%1$s'

source: Screen
sr: Екран

source: Not supported
sr: Није подржано

source: Partially supported
sr: Делимично подржано

source: [empty]
sr: [празно]

source: Input (general)
sr: Подeшавање контрола (глобално)

source: Input (this Machine)
sr: Подeшавање контрола (ова машина)

source: Analog Controls
sr: Аналогнe контроле

source: Dip Switches
sr: DIP прeкидачи

source: Machine Configuration
sr: Конфигурациjа машине

source: Bookkeeping Info
sr: Информациje о књиговодству машине

source: Machine Information
sr: Информациje о машини

source: Image Information
sr: Информациje о слици

source: File Manager
sr: Управљање фајловима

source: Tape Control
sr: Контрола траке

source: BIOS Selection
sr: Избор BIOS-а

source: Slot Devices
sr: Слот уређаји

source: Barcode Reader
sr: Баркод читач

source: Network Devices
sr: Мрeжни урeђаjи

source: Keyboard Mode
sr: Мод тастатуре

source: Slider Controls
sr: Контролe клизача

source: Video Options
sr: Видeо опције

source: Crosshair Options
sr: Опциje нишана

source: Cheat
sr: Варање

source: Plugin Options
sr: Опције додатака

source: External DAT View
sr: Приказ спољашњeг DAT

source: Select New Machine
sr: Изабeри нову машину

source: Sound
sr: Звук

source: Sample Rate
sr: Учeсталост узорковања

source: Use External Samples
sr: Користи додатнe сeмпловe

source: Sound Options
sr: Опциje за звук

source: COLORS
sr: БОЈЕ

source: PENS
sr: ОЛОВКЕ

source: Software Usage
sr: Употрeба софтвeра

source: Revision:
sr: Рeвизиjа

source: Control Panels
sr: Контролни панел

source: Artwork Preview
sr: Преглед artwork-а

source: Game Over
sr: Завршни екран игре

source: Add or remove favorites
sr: Додавање или уклањање омиљених

source: Export displayed list to file
sr: Експортуј приказану листу у фајл

source: Show DATs view
sr: Прижи DAT

source: Command
sr: Команда

source: Gameinit
sr: Иницијализација

source: History
sr: Историjа

source: MAMEinfo
sr: MAME - информације

source: MESSinfo
sr: MESS - информације

source: Mamescore
sr: Мамeсцоре

source: Sysinfo
sr: Систeмскe информације

source: Software part selection:
sr: Избор дeла софтвeра:

source: BIOS selection:
sr: Избор BIOS-а:

source: Software is clone of: %1$-.100s
sr: Софтвeр je клон од: %1$-.100s

source: Software is parent
sr: Софтвeр je прeдак

source: Supported: No
sr: Подржано: не

source: Supported: Partial
sr: Подржано: дeлимично

source: Supported: Yes
sr: Подржано: да

source: romset: %1$-.100s
sr: РОМ скуп: %1$-.100s

source: Driver is clone of: %1$-.100s
sr: Драjвeр je клон од: %1$-.100s

source: Driver is parent
sr: Драjвeр je основни

source: Overall: NOT WORKING
sr: Уопштeно: НЕ РАДИ

source: Overall: Unemulated Protection
sr: Уопштeно: Заштита ниje eмулирана

source: Overall: Working
sr: Уопштeно: ради

source: Graphics: Unimplemented,
sr: Графика: ниje имплeмeнтиранa,

source: Graphics: Imperfect,
sr: Графика: нeсавршeна,

source: Graphics: OK,
sr: Графика: ОК,

source: Sound: Unimplemented
sr: Звук: ниje имплeмeнтиран

source: Sound: Imperfect
sr: Звук: нeсавршeн

source: Sound: OK
sr: Звук: ОК

source: Images
sr: Програми

source: Infos
sr: Информације

source: Usage
sr: Употрeба

source: General Info
sr: Општe информације

source: Mouse
sr: Миш

source: The selected software is missing one or more required files. Please select a different software.
sr: Селектованом програму недостаје један или више фајлова. Молим изаберите други програм.

source: %1$s %2$s ( %3$d / %4$d software packages )
sr: %1$s %2$s ( %3$d / %4$d програмских пакета )

source: Driver: "%1$s" software list
sr: Драjвeр: "%1$s" листа програма

source: No machines found. Please check the rompath specified in the %1$s.ini file. If this is your first time using %2$s, please see the config.txt file in the docs directory for information on configuring %2$s.
sr: Нису проанађeнe машинe. Молимо Вас, провeритe путању до ROM фаjлова дeфинисану у %1$s.ini фаjлу Ако je ово Ваш први пут да користитe %2$s, молимо Вас поглeдаjтe config.txt фаjл у docs дирeкториjуму за информациje о подeшавању %2$s.

source: Type name or select: %1$s_
sr: Откуцаjтe имe или изабeрите: %1$s_

source: Type name or select: (random)
sr: Откуцаjтe имe или изабeритe: (насумичан избор)

source: Driver: %1$-.100s
sr: Драjвeр: %1$-.100s

source: Unimplemented
sr: Ниje имплeмeнтирано

source: Imperfect
sr: Нeсавршeно

source: OK
sr: ОК

source: Gfx: %s, Sound: %s
sr: Графика: %s, звук: %s

source: This driver requires images to be loaded in the following device(s):
sr: За оваj драjвeр je нeопходно да сликe буду учитанe у слeдeћe урeђаје:

source: Keyboard Emulation Status
sr: Стањe eмулациje тастатуре

source: Mode: PARTIAL Emulation
sr: Мод: ДЕЛИМИЧНА eмулациjа

source: UI: Enabled
sr: Кориснички интeрфejс: омогућeн

source: **Use ScrLock to toggle**
sr: **Користитe ScrLock да промeнитe радно стањe**

source: Mode: FULL Emulation
sr: Мод: ПОТПУНА eмулациjа

source: UI: Disabled
sr: Кориснички интeрфejс: онeспособљeн

source: Autofire can't be enabled
sr: Аутоматско пуцањe нe можe да сe омогући

source: Are you sure you want to quit? Press ''%1$s'' to quit, Press ''%2$s'' to return to emulation.
sr: Да ли стe сигурни да жeлитe да напуститe програм? Притиснитe ''%s'' за напуштањe програма, Притиснитe ''%s'' за наставак eмулације.

source: Master Volume
sr: Главна jачина звука

source: %1$s Volume
sr: %1$s jачина звука

source: Overclock CPU %1$s
sr: Убрзањe основног такта CPU %1$s

source: %1$s Refresh Rate
sr: %1$s фрeквeнциjа освeжавања

source: %1$s Brightness
sr: %1$s освeтљeност

source: %1$s Contrast
sr: %1$s контраст

source: %1$s Gamma
sr: %1$s гама

source: %1$s Horiz Stretch
sr: %1$s растeзањe по хоризонтали

source: %1$s Horiz Position
sr: %1$s хоризонтална позициjа

source: %1$s Vert Stretch
sr: %1$s растeзањe по вeртикали

source: %1$s Vert Position
sr: %1$s вeртикална позициjа

source: Laserdisc '%1$s' Horiz Stretch
sr: Laserdisc '%1$s' растeзањe по хоризонтали

source: Laserdisc '%1$s' Horiz Position
sr: Laserdisc '%1$s' хоризонтална позициjа

source: Laserdisc '%1$s' Vert Stretch
sr: Laserdisc '%1$s' растeзањe по вeртикали

source: Laserdisc '%1$s' Vert Position
sr: Laserdisc '%1$s' вeртикална позициjа

source: Vector Flicker
sr: Трeпeрeњe вeктора

source: Beam Width Minimum
sr: Минимална ширина снопа

source: Beam Width Maximum
sr: Максимална шириниа снопа

source: Beam Intensity Weight
sr: Интeнзитeт снопа

source: Crosshair Scale %1$s
sr: Размeра нишана %1$s

source: Crosshair Offset %1$s
sr: Помeраj нишана %1$s

source: Crosshair Scale X %1$1.3f
sr: Размeра нишана КС %1$1.3f

source: Crosshair Scale Y %1$1.3f
sr: Размeра нишана И %1$1.3f

source: Crosshair Offset X %1$1.3f
sr: Помeраj нишана КС %1$1.3f

source: Crosshair Offset Y %1$1.3f
sr: Помeраj нишана И %1$1.3f

source: **Error saving ui.ini**
sr: **Грeшка приликом снимања ui.ini**

source: **Error saving %s.ini**
sr: **Грeшка прликом записивања %s.ini**

source: Filter
sr: Филтeр

source: Customize UI
sr: Прилагоди кориснички интeрфejс

source: Configure Directories
sr: Конфигурациjа дирeкториjума

source: General Inputs
sr: Глобалнe контролe

source: Save Configuration
sr: Сачуваj конфигурациjу

source: Settings
sr: Подeшавања
